Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_5 (Bidirection (None, 128)               33792     
_________________________________________________________________
self_attention_45 (SelfAtten (None, 128)               8320      
_________________________________________________________________
dense_45 (Dense)             (None, 32)                4128      
_________________________________________________________________
self_attention_46 (SelfAtten (None, 32)                1088      
_________________________________________________________________
dense_46 (Dense)             (None, 32)                1056      
_________________________________________________________________
self_attention_47 (SelfAtten (None, 32)                1088      
_________________________________________________________________
dense_47 (Dense)             (None, 16)                528       
_________________________________________________________________
self_attention_48 (SelfAtten (None, 16)                288       
_________________________________________________________________
dense_48 (Dense)             (None, 16)                272       
_________________________________________________________________
self_attention_49 (SelfAtten (None, 16)                288       
_________________________________________________________________
dense_49 (Dense)             (None, 8)                 136       
_________________________________________________________________
self_attention_50 (SelfAtten (None, 8)                 80        
_________________________________________________________________
dense_50 (Dense)             (None, 8)                 72        
_________________________________________________________________
self_attention_51 (SelfAtten (None, 8)                 80        
_________________________________________________________________
dense_51 (Dense)             (None, 4)                 36        
_________________________________________________________________
self_attention_52 (SelfAtten (None, 4)                 24        
_________________________________________________________________
dense_52 (Dense)             (None, 4)                 20        
_________________________________________________________________
self_attention_53 (SelfAtten (None, 4)                 24        
_________________________________________________________________
dense_53 (Dense)             (None, 2)                 10        
_________________________________________________________________
self_attention_54 (SelfAtten (None, 2)                 8         
_________________________________________________________________
dense_54 (Dense)             (None, 2)                 6         
_________________________________________________________________
self_attention_55 (SelfAtten (None, 2)                 8         
_________________________________________________________________
dense_55 (Dense)             (None, 1)                 3         
=================================================================
Total params: 51,355
Trainable params: 51,355
Non-trainable params: 0
_________________________________________________________________
