Model: "sequential_35"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_45 (LSTM)               (None, 101, 64)           22528     
_________________________________________________________________
dropout_35 (Dropout)         (None, 101, 64)           0         
_________________________________________________________________
dense_72 (Dense)             (None, 101, 32)           2080      
_________________________________________________________________
dense_73 (Dense)             (None, 101, 1)            33        
=================================================================
Total params: 24,641
Trainable params: 24,641
Non-trainable params: 0
_________________________________________________________________
