Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_1 (Bidirection (None, 128)               36096     
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
self_attention_1 (SelfAttent (None, 128)               8320      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                4128      
_________________________________________________________________
self_attention_2 (SelfAttent (None, 32)                1088      
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
self_attention_3 (SelfAttent (None, 32)                1088      
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528       
_________________________________________________________________
self_attention_4 (SelfAttent (None, 16)                288       
_________________________________________________________________
dense_4 (Dense)              (None, 16)                272       
_________________________________________________________________
self_attention_5 (SelfAttent (None, 16)                288       
_________________________________________________________________
dense_5 (Dense)              (None, 8)                 136       
_________________________________________________________________
self_attention_6 (SelfAttent (None, 8)                 80        
_________________________________________________________________
dense_6 (Dense)              (None, 8)                 72        
_________________________________________________________________
self_attention_7 (SelfAttent (None, 8)                 80        
_________________________________________________________________
dense_7 (Dense)              (None, 4)                 36        
_________________________________________________________________
self_attention_8 (SelfAttent (None, 4)                 24        
_________________________________________________________________
dense_8 (Dense)              (None, 4)                 20        
_________________________________________________________________
self_attention_9 (SelfAttent (None, 4)                 24        
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 10        
_________________________________________________________________
self_attention_10 (SelfAtten (None, 2)                 8         
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 6         
_________________________________________________________________
self_attention_11 (SelfAtten (None, 2)                 8         
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 3         
=================================================================
Total params: 53,659
Trainable params: 53,659
Non-trainable params: 0
_________________________________________________________________
