Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional_3 (Bidirection (None, 128)               36096     
_________________________________________________________________
self_attention_23 (SelfAtten (None, 128)               8320      
_________________________________________________________________
dense_23 (Dense)             (None, 32)                4128      
_________________________________________________________________
self_attention_24 (SelfAtten (None, 32)                1088      
_________________________________________________________________
dense_24 (Dense)             (None, 32)                1056      
_________________________________________________________________
self_attention_25 (SelfAtten (None, 32)                1088      
_________________________________________________________________
dense_25 (Dense)             (None, 16)                528       
_________________________________________________________________
self_attention_26 (SelfAtten (None, 16)                288       
_________________________________________________________________
dense_26 (Dense)             (None, 16)                272       
_________________________________________________________________
self_attention_27 (SelfAtten (None, 16)                288       
_________________________________________________________________
dense_27 (Dense)             (None, 8)                 136       
_________________________________________________________________
self_attention_28 (SelfAtten (None, 8)                 80        
_________________________________________________________________
dense_28 (Dense)             (None, 8)                 72        
_________________________________________________________________
self_attention_29 (SelfAtten (None, 8)                 80        
_________________________________________________________________
dense_29 (Dense)             (None, 4)                 36        
_________________________________________________________________
self_attention_30 (SelfAtten (None, 4)                 24        
_________________________________________________________________
dense_30 (Dense)             (None, 4)                 20        
_________________________________________________________________
self_attention_31 (SelfAtten (None, 4)                 24        
_________________________________________________________________
dense_31 (Dense)             (None, 2)                 10        
_________________________________________________________________
self_attention_32 (SelfAtten (None, 2)                 8         
_________________________________________________________________
dense_32 (Dense)             (None, 2)                 6         
_________________________________________________________________
self_attention_33 (SelfAtten (None, 2)                 8         
_________________________________________________________________
dense_33 (Dense)             (None, 1)                 3         
=================================================================
Total params: 53,659
Trainable params: 53,659
Non-trainable params: 0
_________________________________________________________________
